src/Documents/ITЗаявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ITЗаявка</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заявитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПроблемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокРеакции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРеакции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Назначена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетУточнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Решена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ITЗаявка/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ДобавитьУсловиеОтбора(КоллекцияЭлементов, ИмяПоля, Значение)

	ЭлементОтбора = КоллекцияЭлементов.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));

	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);

	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;

	ЭлементОтбора.ПравоеЗначение = Значение;
	ЭлементОтбора.Использование = Истина;

КонецПроцедуры

&НаСервере
Процедура НастроитьОтборЗаявокПоРолям(Отказ)

	ЭтоАдминистратор = РольДоступна("АдминистраторСистемы");
	ЭтоРуководитель = РольДоступна("РуководительITОтдела");
	ЭтоСотрудник = РольДоступна("ПользовательСотрудник");
	ЭтоИсполнитель = РольДоступна("ИсполнительЗаявок");
    ЭтоОтветственныйЗаОборудование = РольДоступна("ОтветственныйЗаОборудование");
	
	Если ЭтоАдминистратор ИЛИ ЭтоРуководитель Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЭтоСотрудник И НЕ ЭтоИсполнитель И НЕ ЭтоОтветственныйЗаОборудование Тогда
		Сообщить("Для текущей роли просмотр заявок пока не настроен.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Попытка
		ТекущийСотрудник = УправлениеПользователямиСервер.ПолучитьТекущегоСотрудника();
	Исключение
		Сообщить("Не удалось определить текущего сотрудника. " + ОписаниеОшибки());
		Отказ = Истина;
		Возврат;
	КонецПопытки;

	Если ТекущийСотрудник = Неопределено Тогда
		Сообщить("Пользователь ИБ не связан с активным сотрудником.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;  
	
	Если ЭтоОтветственныйЗаОборудование И НЕ ТекущийСотрудник.ОтветственныйЗаОборудование Тогда	
		Сообщить("У текущего сотрудника не установлен признак ""Ответственный за оборудование"".");		
		Отказ = Истина;
		Возврат;
	КонецЕсли;	

	Отбор = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор;

	КоличествоУсловий = 0;

	Если ЭтоСотрудник Тогда
		КоличествоУсловий = КоличествоУсловий + 1;
	КонецЕсли;

	Если ЭтоИсполнитель Тогда
		КоличествоУсловий = КоличествоУсловий + 1;
	КонецЕсли;

	Если ЭтоОтветственныйЗаОборудование Тогда
		КоличествоУсловий = КоличествоУсловий + 1;
	КонецЕсли;

	КоллекцияЭлементов = Отбор.Элементы;

	Если КоличествоУсловий > 1 Тогда	
		ГруппаОтбора = Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.Использование = Истина;	
		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		КоллекцияЭлементов = ГруппаОтбора.Элементы;		
	КонецЕсли;

	Если ЭтоСотрудник Тогда
		ДобавитьУсловиеОтбора(КоллекцияЭлементов, "Заявитель", ТекущийСотрудник);
	КонецЕсли;

	Если ЭтоИсполнитель Тогда
		ДобавитьУсловиеОтбора(КоллекцияЭлементов, "Исполнитель", ТекущийСотрудник);
	КонецЕсли;

	Если ЭтоОтветственныйЗаОборудование Тогда
		ДобавитьУсловиеОтбора(КоллекцияЭлементов, "ТекущийСтатус", Перечисления.СтатусыЗаявок.ОжидаетОборудование);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастроитьОтборЗаявокПоРолям(Отказ);
КонецПроцедуры
